In [1]:
import pandas as pd

In [2]:
sample = pd.read_csv('sample_pandas_normal.csv')

In [3]:
sample

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [15]:
sample[sample['name']=="Alice"]['age']

0    24
Name: age, dtype: int64

In [16]:
sample.name

0      Alice
1        Bob
2    Charlie
3       Dave
4      Ellen
5      Frank
Name: name, dtype: object

In [17]:
sample.query('state in ["NY", "TX"]')

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

In [19]:
sample.shape[1]

4

In [21]:
sample.shape[0]

6